Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УчетныеЗаписиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Comment> доступны данные всех учетных записей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПревышениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьСнижениеЦенНа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>удалить</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Курс считается отностительно базовой валюты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВИнвойсах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВОплатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодISO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичнаяИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
					<Comment>Склады, на к-рых сотрудник работает оператором</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Справочники/Ext/Module.bsl
// Справочники StockAPI: форматирование кодов, поиск фирмы/склада/контрагента, списки складов и валют.

// Поиск склада: сначала из запроса, затем склад фирмы, затем первый доступный склад.  
//
Функция НайтиСклад(ДанныеЗапроса, УчетнаяЗапись, Ошибка) Экспорт
	
	ПараметрКод = Неопределено;
	ПараметрИмя = Неопределено;

	ПараметрКод = StockAPI_Утилиты.СвойствоДанныхЗапроса(ДанныеЗапроса, "warehouseId,warehouseCode", Неопределено);	

	Если ПараметрКод = Неопределено Тогда  
		Если ДанныеЗапроса.Свойство("warehouse") И СокрЛП(ДанныеЗапроса.warehouse) <> ""  Тогда
			ПараметрИмя = СокрЛП(ДанныеЗапроса.warehouse);
		Иначе
			Ошибка = "Не указан код или наименование склада: warehouseId, или warehouseCode, или warehouse (наименование).";
			Возврат Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	Иначе	
		Попытка
			ПараметрКод = Число(СокрЛП(Строка(ПараметрКод)));
		Исключение
			Ошибка = "Параметр warehouseId (или warehouseCode) должен быть числовым кодом склада.";
			Возврат Справочники.Склады.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ШаблонПоискаКод", ПараметрКод); 
	Запр.УстановитьПараметр("ШаблонПоискаИмя", ПараметрИмя);
	
	Если StockAPI_Утилиты.ЭтоАдминистраторAPI(УчетнаяЗапись) Тогда
		ОбщиеСклады = StockAPI_Утилиты.СкладыОбщиеДляВсехУчетныхЗаписейAPI();
		Запр.УстановитьПараметр("ОбщиеСклады", ОбщиеСклады);
		Запр.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		             |	Склады.Ссылка КАК Склад
		             |ИЗ
		             |	Справочник.Склады КАК Склады
		             |ГДЕ
		             |	Склады.Ссылка В (&ОбщиеСклады)
		             |	И НЕ Склады.ПометкаУдаления
		             |	И ВЫБОР
		             |			КОГДА &ШаблонПоискаКод = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Код = &ШаблонПоискаКод
		             |		КОНЕЦ
		             |	И ВЫБОР
		             |			КОГДА &ШаблонПоискаИмя = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Наименование = &ШаблонПоискаИмя
		             |		КОНЕЦ";
	Иначе
		Запр.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
		Запр.Текст = "ВЫБРАТЬ
		             |	Склады.Склад КАК Склад
		             |ИЗ
		             |	Справочник.УчетныеЗаписиИнтеграции.Склады КАК Склады
		             |ГДЕ
		             |	Склады.Ссылка = &УчетнаяЗапись
		             |	И ВЫБОР
		             |			КОГДА &ШаблонПоискаКод = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Склад.Код = &ШаблонПоискаКод
		             |		КОНЕЦ
		             |	И ВЫБОР
		             |			КОГДА &ШаблонПоискаИмя = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Склад.Наименование = &ШаблонПоискаИмя
		             |		КОНЕЦ";
	КонецЕсли;
	
	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Ошибка = СтрШаблон("Не найден склад (или нет доступа к указанному складу) '%1'.", ДанныеЗапроса.warehouse);
		Возврат Справочники.Склады.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий(); 
		Возврат Выборка.Склад;   
	КонецЕсли;

КонецФункции

// GET /warehouses — список складов с фильтрацией по доступу, поиску, коду.
//
Функция ПолучитьСписокСкладов(ЗапросАПИ) Экспорт
	
	СтрокаПоиска = "";
	ПараметрПоиска = ЗапросАПИ.ПараметрыЗапроса.Получить("search");
	Если ПараметрПоиска <> Неопределено Тогда
		СтрокаПоиска = СокрЛП(ПараметрПоиска);
	КонецЕсли;
	ШаблонПоиска = ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", "");
	
	СтрокаКода = "";
	ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("warehouseCode");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтрокаКода) Тогда
		КодЧисло = Число(СтрокаКода);
	Иначе
		КодЧисло = Неопределено;
	КонецЕсли;
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ШаблонПоиска", ШаблонПоиска);
	Запр.УстановитьПараметр("Код", КодЧисло);
	
	ТокенАвторизации = ЗапросАПИ.Заголовки.Получить("X-Api-Key");
	УчетнаяЗапись = Справочники.УчетныеЗаписиИнтеграции.НайтиПоРеквизиту("ТокенАвторизации", ТокенАвторизации);
	
	Если StockAPI_Утилиты.ЭтоАдминистраторAPI(УчетнаяЗапись) Тогда
		Запр.УстановитьПараметр("ОбщиеСклады", StockAPI_Утилиты.СкладыОбщиеДляВсехУчетныхЗаписейAPI());
		Запр.Текст = "ВЫБРАТЬ
		             |	Склады.Наименование КАК Наименование,
		             |	Склады.НаименованиеАнгл КАК НаименованиеАнгл,
		             |	Склады.Код КАК Код
		             |ИЗ
		             |	Справочник.Склады КАК Склады
		             |ГДЕ
		             |	Склады.Ссылка В (&ОбщиеСклады)
		             |	И НЕ Склады.ПометкаУдаления
		             |	И ВЫБОР
		             |			КОГДА &ШаблонПоиска = """"
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Наименование ПОДОБНО &ШаблонПоиска
		             |		КОНЕЦ
		             |	И ВЫБОР
		             |			КОГДА &Код = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Код = &Код
		             |		КОНЕЦ";
	Иначе
		Запр.Текст = "ВЫБРАТЬ
		             |	Склады.Склад.Наименование КАК Наименование,
		             |	Склады.Склад.НаименованиеАнгл КАК НаименованиеАнгл,
		             |	Склады.Склад.Код КАК Код
		             |ИЗ
		             |	Справочник.УчетныеЗаписиИнтеграции.Склады КАК Склады
		             |ГДЕ
		             |	Склады.Ссылка.ТокенАвторизации = &ТокенАвторизации
		             |	И ВЫБОР
		             |			КОГДА &ШаблонПоиска = """"
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Склад.Наименование ПОДОБНО &ШаблонПоиска
		             |		КОНЕЦ
		             |	И ВЫБОР
		             |			КОГДА &Код = НЕОПРЕДЕЛЕНО
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ Склады.Склад.Код = &Код
		             |		КОНЕЦ";
		Запр.УстановитьПараметр("ТокенАвторизации", ТокенАвторизации);
	КонецЕсли;
	
	Таблица = Запр.Выполнить().Выгрузить();
	Массив = Новый Массив;
	
	Для Каждого Стр Из Таблица Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("warehouse", 		Стр.Наименование);
		Элемент.Вставить("warehouseEn", 	Стр.НаименованиеАнгл);
		Элемент.Вставить("warehouseCode", 	StockAPI_Утилиты.КодВСтроку(Стр.Код));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// + GET /currencies — список валют с фильтрацией по поиску и коду.    
//
Функция ПолучитьСписокВалют(ЗапросАПИ) Экспорт
	
	СтрокаПоиска = "";
	ПараметрПоиска = ЗапросАПИ.ПараметрыЗапроса.Получить("search");
	Если ПараметрПоиска <> Неопределено Тогда
		СтрокаПоиска = СокрЛП(ПараметрПоиска);
	КонецЕсли;
	ШаблонПоиска = ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", "");

	СтрокаКода = "";
	ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("currencyCode");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтрокаКода) Тогда
		КодЧисло = Число(СтрокаКода);
	Иначе
		КодЧисло = Неопределено;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Вал.КодISO КАК Код,
	            |	Вал.Наименование КАК currency,
	            |	Вал.Символ КАК Символ
	            |ИЗ
	            |	Справочник.Валюты КАК Вал
	            |ГДЕ
	            |	НЕ Вал.ПометкаУдаления
	            |	И ВЫБОР
	            |			КОГДА &ШаблонПоиска = """"
	            |				ТОГДА ИСТИНА
	            |			ИНАЧЕ Вал.Наименование ПОДОБНО &ШаблонПоиска
	            |		КОНЕЦ
	            |	И ВЫБОР
	            |			КОГДА &Код = НЕОПРЕДЕЛЕНО
	            |				ТОГДА ИСТИНА
	            |			ИНАЧЕ Вал.КодISO = &Код
	            |		КОНЕЦ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Вал.Наименование";
	Зап.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	Зап.УстановитьПараметр("Код", 			КодЧисло);
	
	Выборка  = Зап.Выполнить().Выбрать();
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("currencyCode", 	СокрЛП(Выборка.Код));
		Элемент.Вставить("currency", 		Строка(Выборка.currency));
		//Элемент.Вставить("symbol", 		Строка(Выборка.symbol));
		Элемент.Вставить("sign", 			Строка(Выборка.Символ));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Поиск сотрудника-оператора склада по коду (приоритет) или пину среди складов учётной записи API.
//    
Функция НайтиСотрудника(КодСотрудника, ПинСотрудника, УчетнаяЗапись, Ошибка = "") Экспорт
	
	СтрокаКода = СокрЛП(Строка(КодСотрудника));
	СтрокаПина = СокрЛП(Строка(ПинСотрудника));
	ПоКоду = СтрокаКода <> "";
	
	Если НЕ ПоКоду И СтрокаПина = "" Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
	//	Ошибка = "Не указана учётная запись для поиска сотрудника.";
	//	Возврат Справочники.Сотрудники.ПустаяСсылка();
	//КонецЕсли;
	
	КодЧисло = 0;
	ПинЧисло = 0;
	
	Если ПоКоду Тогда
		Попытка
			КодЧисло = Число(СтрокаКода);
		Исключение
			Ошибка = "Параметр employeeCode должен быть числовым кодом сотрудника.";
			Возврат Справочники.Сотрудники.ПустаяСсылка();
		КонецПопытки;
	Иначе
		Попытка
			ПинЧисло = Число(СтрокаПина);
		Исключение
			Ошибка = "Параметр employeePin должен быть числом.";
			Возврат Справочники.Сотрудники.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Если StockAPI_Утилиты.ЭтоАдминистраторAPI(УчетнаяЗапись) Тогда
		Зап.УстановитьПараметр("ОбщиеСотрудники", StockAPI_Утилиты.СотрудникиОбщиеДляВсехУчетныхЗаписейAPI());
		Зап.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		            |	Сотрудники.Ссылка КАК Ссылка
		            |ИЗ
		            |	Справочник.Сотрудники КАК Сотрудники
		            |ГДЕ
		            |	Сотрудники.Ссылка В (&ОбщиеСотрудники)
		            |	И НЕ Сотрудники.ЭтоГруппа
		            |	И НЕ Сотрудники.ПометкаУдаления
		            |	И (Сотрудники.ДатаУвольнения = &ПустаяДата
		            |			ИЛИ Сотрудники.ДатаУвольнения >= &ТекущаяДата)
		            |	И ВЫБОР
		            |			КОГДА &ПоКоду
		            |				ТОГДА Сотрудники.Код = &Код
		            |			ИНАЧЕ Сотрудники.Пин = &Пин
		            |		КОНЕЦ";
	Иначе
		Зап.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		            |	Сотрудники.Ссылка КАК Ссылка
		            |ИЗ
		            |	Справочник.Сотрудники.Склады КАК СотрудникиСклады
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		            |		ПО СотрудникиСклады.Ссылка = Сотрудники.Ссылка
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции.Склады КАК СкладыУчетнойЗаписи
		            |		ПО СотрудникиСклады.Склад = СкладыУчетнойЗаписи.Склад
		            |			И (СкладыУчетнойЗаписи.Ссылка = &УчетнаяЗапись)
		            |ГДЕ
		            |	НЕ Сотрудники.ЭтоГруппа
		            |	И НЕ Сотрудники.ПометкаУдаления
		            |	И (Сотрудники.ДатаУвольнения = &ПустаяДата
		            |			ИЛИ Сотрудники.ДатаУвольнения >= &ТекущаяДата)
		            |	И ВЫБОР
		            |			КОГДА &ПоКоду
		            |				ТОГДА Сотрудники.Код = &Код
		            |			ИНАЧЕ Сотрудники.Пин = &Пин
		            |		КОНЕЦ";
		Зап.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	КонецЕсли;
	Зап.УстановитьПараметр("ПоКоду", 		ПоКоду);
	Зап.УстановитьПараметр("Код", 			КодЧисло);
	Зап.УстановитьПараметр("Пин", 			ПинЧисло); 
	Зап.УстановитьПараметр("ПустаяДата", 	Дата(1, 1, 1));
	Зап.УстановитьПараметр("ТекущаяДата", 	НачалоДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Зап.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Если ПоКоду Тогда
			Ошибка = СтрШаблон("Сотрудник с кодом %1 не найден среди операторов складов, доступных учётной записи API.", СтрокаКода);
		Иначе
			Ошибка = СтрШаблон("Сотрудник с пином %1 не найден среди операторов складов, доступных учётной записи API.", СтрокаПина);
		КонецЕсли;
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

// Сотрудник-оператор склада из параметров запроса API (employeeCode, employeePin).
//
Функция СотрудникИзДанныхЗапроса(ДанныеЗапроса, УчетнаяЗапись) Экспорт	

	Результат = Новый Структура("Сотрудник, Ошибка", Справочники.Сотрудники.ПустаяСсылка(), "");
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("employeeCode") Тогда
		КодСотрудника = ДанныеЗапроса.employeeCode;
	Иначе
	    КодСотрудника = "";
	КонецЕсли;                       
	Если ДанныеЗапроса.Свойство("employeePin") Тогда
		ПинСотрудника = ДанныеЗапроса.employeePin;
	Иначе
	    ПинСотрудника = "";
	КонецЕсли;                       
	
	Если СокрЛП(Строка(КодСотрудника)) = "" И СокрЛП(Строка(ПинСотрудника)) = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОшибкаПоиска = "";
	Сотрудник = НайтиСотрудника(КодСотрудника, ПинСотрудника, УчетнаяЗапись, ОшибкаПоиска);
	Результат.Сотрудник = Сотрудник;
	Результат.Ошибка = ОшибкаПоиска;
	Возврат Результат;
	
КонецФункции

// GET /emploees — сотрудники склада (операторы) по табличной части Сотрудники.Склады.
//
// Параметры:
//  Запрос          - HTTPСервисЗапрос - параметры warehouseCode/warehouse, search;
//  УчетнаяЗапись   - СправочникСсылка.УчетныеЗаписиИнтеграции - учётная запись API.
//
// Возвращаемое значение:
//  Структура - поля Тело, Ошибка, НеНайден.
//
Функция ПолучитьСотрудниковСклада(Запрос, УчетнаяЗапись) Экспорт
	
	Результат = Новый Структура("Тело, Ошибка, НеНайден", Неопределено, "", Ложь);
	
	ДанныеСклада = Новый Структура;
	СтрокаКода = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "warehouseCode");
	Если СтрокаКода <> "" Тогда
		ДанныеСклада.Вставить("warehouseCode", СтрокаКода);
	КонецЕсли;
	СтрокаИмени = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "warehouse");
	Если СтрокаИмени <> "" Тогда
		ДанныеСклада.Вставить("warehouse", СтрокаИмени);
	КонецЕсли;
	
	ОшибкаСклада = "";
	Склад = НайтиСклад(ДанныеСклада, УчетнаяЗапись, ОшибкаСклада);
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Результат.Ошибка = ОшибкаСклада;
		Результат.НеНайден = Истина;
		Возврат Результат;
	КонецЕсли;
	
	СтрокаПоиска = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "search");
	ШаблонПоиска = ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", "");
	
	Зап = Новый Запрос;
	Если StockAPI_Утилиты.ЭтоАдминистраторAPI(УчетнаяЗапись) Тогда
		Зап.УстановитьПараметр("ОбщиеСотрудники", StockAPI_Утилиты.СотрудникиОбщиеДляВсехУчетныхЗаписейAPI());
		Зап.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		            |	Сотрудники.Наименование КАК Наименование,
		            |	Сотрудники.Код КАК Код,
		            |	Сотрудники.Пин КАК Пин
		            |ИЗ
		            |	Справочник.Сотрудники.Склады КАК СотрудникиСклады
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		            |		ПО СотрудникиСклады.Ссылка = Сотрудники.Ссылка
		            |ГДЕ
		            |	СотрудникиСклады.Склад = &Склад
		            |	И Сотрудники.Ссылка В (&ОбщиеСотрудники)
		            |	И НЕ Сотрудники.ЭтоГруппа
		            |	И НЕ Сотрудники.ПометкаУдаления
		            |	И (Сотрудники.ДатаУвольнения = &ПустаяДата
		            |			ИЛИ Сотрудники.ДатаУвольнения >= &ТекущаяДата)
		            |	И ВЫБОР
		            |			КОГДА &СтрокаПоиска = """"
		            |				ТОГДА ИСТИНА
		            |			ИНАЧЕ Сотрудники.Наименование ПОДОБНО &ШаблонПоиска
		            |					ИЛИ Сотрудники.Код = &СтрокаПоиска
		            |		КОНЕЦ
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	Сотрудники.Наименование";
	Иначе
		Зап.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		            |	Сотрудники.Наименование КАК Наименование,
		            |	Сотрудники.Код КАК Код,
		            |	Сотрудники.Пин КАК Пин
		            |ИЗ
		            |	Справочник.Сотрудники.Склады КАК СотрудникиСклады
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		            |		ПО СотрудникиСклады.Ссылка = Сотрудники.Ссылка
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции.Склады КАК СкладыУчетнойЗаписи
		            |		ПО СотрудникиСклады.Склад = СкладыУчетнойЗаписи.Склад
		            |			И (СкладыУчетнойЗаписи.Ссылка = &УчетнаяЗапись)
		            |ГДЕ
		            |	СотрудникиСклады.Склад = &Склад
		            |	И НЕ Сотрудники.ЭтоГруппа
		            |	И НЕ Сотрудники.ПометкаУдаления
		            |	И (Сотрудники.ДатаУвольнения = &ПустаяДата
		            |			ИЛИ Сотрудники.ДатаУвольнения >= &ТекущаяДата)
		            |	И ВЫБОР
		            |			КОГДА &СтрокаПоиска = """"
		            |				ТОГДА ИСТИНА
		            |			ИНАЧЕ Сотрудники.Наименование ПОДОБНО &ШаблонПоиска
		            |					ИЛИ Сотрудники.Код = &СтрокаПоиска
		            |		КОНЕЦ
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	Сотрудники.Наименование";
		Зап.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	КонецЕсли;
	Зап.УстановитьПараметр("Склад", 		Склад);
	Зап.УстановитьПараметр("ПустаяДата", 	Дата(1, 1, 1));
	Зап.УстановитьПараметр("ТекущаяДата", 	НачалоДня(ТекущаяДатаСеанса()));
	Зап.УстановитьПараметр("СтрокаПоиска", 	СтрокаПоиска);
	Зап.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	
	МассивСотрудников = Новый Массив;
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("employee", 		Выборка.Наименование);
		Элемент.Вставить("employeeCode", 	StockAPI_Утилиты.КодВСтроку(Выборка.Код));
		Элемент.Вставить("pin", 			StockAPI_Утилиты.КодВСтроку(Выборка.Пин));
		МассивСотрудников.Добавить(Элемент);
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("warehouse", 		Склад.Наименование);
	ТелоОтвета.Вставить("warehouseCode", 	StockAPI_Утилиты.КодВСтроку(Склад.Код));
	ТелоОтвета.Вставить("employees", 		МассивСотрудников);
	Результат.Тело = ТелоОтвета;
	Возврат Результат;
	
КонецФункции

// GET /brands — элементы первого уровня справочника Номенклатура с типом «Товар».
//
// Возвращаемое значение:
//  Массив из Структура - Код, Наименование.
//
Функция ПолучитьСписокБрендов() Экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Ном.Код КАК Код,
	            |	Ном.Наименование КАК Наименование
	            |ИЗ
	            |	Справочник.Номенклатура КАК Ном
	            |ГДЕ
	            |	Ном.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	            |	И НЕ Ном.ПометкаУдаления
	            |	И Ном.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	            |	И Ном.ЭтоГруппа
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Ном.Наименование";
	
	Выборка = Зап.Выполнить().Выбрать();
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("code", StockAPI_Утилиты.КодВСтроку(Выборка.Код));
		Элемент.Вставить("brand", СокрЛП(Выборка.Наименование));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции
